[
    {"date":"2020-10-09T15:55:05Z","img":"https:\/\/www.ctvnews.ca\/polopoly_fs\/1.5139614.1602258518!\/httpImage\/image.jpg_gen\/derivatives\/landscape_620\/image.jpg","title":"Pelosi unveils 25th Amendment bid, questions Trump s fitness","content":" WASHINGTON --   House Speaker Nancy Pelosi unveiled legislation Friday that would allow Congress to intervene under the 25th Amendment to the Constitution to remove the president, insisting it s not about U.S. President Donald Trump but inspired by the need for greater congressional oversight of his White House.\nPelosi has been raising questions about Trump s mental fitness since his COVID-19 diagnosis and demanding more transparency about his health. The bill would set up a commission to assess the president s ability to lead the country and ensure a continuity of government. It comes one year after Pelosi s [...]","source_url":"https:\/\/www.ctvnews.ca\/world\/america-votes\/pelosi-unveils-25th-amendment-bid-questions-trump-s-fitness-1.5139611","source_name":"CTVnews","category":"World","keywords":"Pelosi; Amendment; Trump; WASHINGTON; House Speaker Nancy Pelosi; Congress; President Donald Trump; White House; COVID; House; Capitol; Kayleigh McEnany; Fox; Senate Majority Leader McConnell; Kentucky; Election Day; President John; Kennedy; Let Congress; Rep; Jamie Raskin; Md; Senate; McConnell; Bruce Schreiner; Aamer Madhani; Laurie Kellman; Pamananda Rama; Washington"},
    
    {"date":"2020-10-09T15:47:09Z","img":"https:\/\/ichef.bbci.co.uk\/news\/1024\/branded_news\/178A6\/production\/_114822469_gettyimages-1148411751.jpg","title":"Blake Jenner takes  full responsibility  for abuse","content":" Former Glee star Blake Jenner has said he takes \"full responsibility\" for having abused his ex-partner \"emotionally, mentally and physically\".\nJenner played Ryder Lynn in the Fox musical comedy-drama series.\nHis Instagram post, which does not name his ex-partner, follows Supergirl star Melissa Benoist posting last year about domestic violence and an anonymous ex.\nUS news publications and a surge of social media posts have suggested they were each referring to each other.\nWARNING: This article contains details which some people may find upsetting\n\"Over the past 11 months, I have been thinking about how to address a personal situation made public in late-2019,\" wrote [...]","source_url":"https:\/\/www.bbc.co.uk\/news\/entertainment-arts-54474954","source_name":"bbc.com","category":"World","keywords":"Blake Jenner; Former Glee; Jenner; Ryder Lynn; Fox; His Instagram; Supergirl; Melissa Benoist; US; Report End of Instagram; In November; Benoist; Glee; Marley Rose"},{"date":"2020-10-09T16:24:03Z","img":"https:\/\/www.thestar.com\/assets\/img\/thestar-ribbon.png","title":"2 remote Japan towns seek to host nuclear waste storage site","content":" TOKYO - Two remote towns in northern Japan struggling with rapidly graying and shrinking populations signed up Friday to possibly host a high-level radioactive waste storage site as a means of economic survival.\nJapanese utilities have about 16,000 tons of highly radioactive spent fuel rods stored in cooling pools or other interim sites, and there is no final repository for them in Japan — a situation called “a mansion without a toilet.”\nJapan is in a dire situation following the virtual failure of an ambitious nuclear fuel recycling plan, in which plutonium extracted from spent fuel was to be used in still-unbuilt [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/asia\/2020\/10\/09\/2-remote-japan-towns-seek-to-host-nuclear-waste-storage-site.html","source_name":"Toronto Star","category":"World","keywords":"Japan; TOKYO; Japanese; Fukushima; On Friday; Haruo Kataoka; Hokkaido; Tokyo; Later Friday; Masayuki Takahashi; Takahashi; Hokkaido Gov; Naomichi Suzuki"},
    
    {"date":"2020-10-09T16:12:20Z","img":"https:\/\/www.ctvnews.ca\/polopoly_fs\/1.5139155.1602221449!\/httpImage\/image.jpg_gen\/derivatives\/landscape_620\/image.jpg","title":"Louisiana braces to relive a nightmare as Delta nears","content":" LAKE CHARLES, LA. --   Residents in south Louisiana braced to relive a nightmare Friday as rain bands from an approaching Hurricane Delta began soaking the same area that was badly battered by a deadly Hurricane Laura six weeks ago.\nThe city of Lake Charles was already a landscape of towering debris piles still uncollected after Laura. Blue-tarped roofs still stretched as far as the eye could see Friday. Streets were lined with sawed-up trees, mouldy mattresses and box springs and duct work and other wreckage of destroyed or badly damaged buildings. Officials feared Delta could turn the small mountains [...]","source_url":"https:\/\/www.ctvnews.ca\/world\/louisiana-braces-to-relive-a-nightmare-as-delta-nears-1.5139154","source_name":"CTVnews","category":"World","keywords":"Louisiana; Delta; LAKE CHARLES; LA; Hurricane Delta; Hurricane Laura; Lake Charles; Laura; Blue; Roslyn Kennedy; Burton Coliseum; Carla Ardoin; United State; Colorado State University; Phil Klotzbach; Greek; Atlantic; Category; National Hurricane Center; Cameron Parish; New Iberia; Hilton Stroder; Terry; As Delta; Gulf Coast; High Island; Texas; Morgan City; Cameron; Tropical Storm Marco; Tropical Storm Cristobal; And Laura; Rockefeller Wildlife Refuge; Gov; John Bel Edwards; In Cameron Parish; Creole; New Orleans; Mississippi; Tate Reeves; Edwards; Melinda Deslatte; Baton Rouge; Gerald Herbert; Kevin McGill; Seth Borenstein; Kensington; Maryland; Leah Willingham; Jackson"},
    
    {"date":"2020-10-09T16:58:03Z","img":"https:\/\/images.thestar.com\/WEgQmBtYu-sfplZS0QXdYpKEKwE=\/1280x1024\/smart\/filters:cb(1602262053508)\/https:\/\/www.thestar.com\/content\/dam\/thestar\/news\/world\/us\/2020\/10\/09\/challenger-demands-graham-get-covid-19-test-before-debate\/RPMK207-104_2020_000139.jpg","title":"Challenger demands Graham get COVID-19 test before debate","content":" COLUMBIA, S.C. - U.S. Sen. Lindsey Graham and Democratic challenger Jaime Harrison are set to meet for their second debate Friday, although campaign clashes over COVID-19 are stirring doubts of whether the matchup will go on at all.\nGraham campaign officials pointed out that Harrison had not demanded testing before sitting down with reporters from The Post and Courier newspaper for an event Wednesday. Saying he had “taken the coronavirus threat to our state and nation very seriously,” Graham said he would attend the debate regardless.\n“What has changed is not the seriousness of coronavirus — what has changed is the threat [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/us\/2020\/10\/09\/challenger-demands-graham-get-covid-19-test-before-debate.html","source_name":"Toronto Star","category":"World","keywords":"Challenger; Graham; COVID; COLUMBIA; Sen; Lindsey Graham; Democratic; Jaime Harrison; Harrison; Courier; Mr; Whether Mr; Senate Republicans; President Donald Trump; Congress; Washington; As Senate Judiciary Committee; Trump; Supreme Court; Amy Coney Barrett; Senate; Senate Majority Leader Mitch McConnell; South Carolina; Democrat Hillary Clinton; Republicans"},{"date":"2020-10-09T15:33:04Z","img":"https:\/\/www.thestar.com\/assets\/img\/thestar-ribbon.png","title":"Brazil’s poor squeezed by less virus aid, surging food costs","content":" RIO DE JANEIRO - Many people in Brazil are struggling to cope with less pandemic aid from the government and jumping food prices, with millions expected to slip back into poverty.\nBrazil’s government, starting this month, halved the amount of its monthly emergency cash transfers to help Brazil’s poor withstand the hardship of the economic meltdown, down to 300 reais ($54).\nAs the government winds down the program through year-end, with unemployment still high, many of those people who benefited will become newly impoverished, according to Marcelo Neri, director of the social policy centre at the Getulio Vargas Foundation, a university and [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/americas\/2020\/10\/09\/brazils-poor-squeezed-by-less-virus-aid-surging-food-costs.html","source_name":"Toronto Star","category":"World","keywords":"Brazil; RIO DE JANEIRO; Marcelo Neri; Getulio Vargas Foundation; Marcio Santos; Sao Paulo; Nobody; COVID; President Jair Bolsonaro; United Nations General Assembly; Brazilians; Bolsonaro; But the Brazilian; Pedro Kislanov; Cleide Valente; World Bank"},{"date":"2020-10-09T15:41:03Z","img":"https:\/\/images.thestar.com\/oMa7D8V3Uvjbj1UQW-63E45bUjY=\/1280x1024\/smart\/filters:cb(1602258159479)\/https:\/\/www.thestar.com\/content\/dam\/thestar\/news\/world\/us\/2020\/10\/09\/pelosi-unveils-25th-amendment-bid-questions-trumps-fitness\/DCSA403-109_2020_141645.jpg","title":"Pelosi unveils 25th Amendment bid, questions Trump’s fitness","content":" WASHINGTON - House Speaker Nancy Pelosi unveiled legislation Friday that would allow Congress to intervene under the 25th Amendment to the Constitution to remove the president, insisting it’s not about President Donald Trump but inspired by the need for greater congressional oversight of his White House.\nPelosi has been raising questions about Trump’s mental fitness since his COVID-19 diagnosis and demanding more transparency about his health. The bill would set up a commission to assess the president’s ability to lead the country and ensure a continuity of government. It comes one year after Pelosi’s House launched impeachment proceedings against Trump.\n“This is [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/us\/2020\/10\/09\/pelosi-unveils-25th-amendment-bid-questions-trumps-fitness.html","source_name":"Toronto Star","category":"World","keywords":"Pelosi; Amendment; Trump; WASHINGTON; House Speaker Nancy Pelosi; Congress; President Donald Trump; White House; COVID; House; Capitol; Kayleigh McEnany; Fox; Senate Majority Leader McConnell; Kentucky; Election Day; President John; Kennedy; Let Congress; Rep; Jamie Raskin; Md; Senate; McConnell; Bruce Schreiner; Aamer Madhani; Laurie Kellman; Pamananda Rama; Washington"},
    
    {"date":"2020-10-09T16:14:26Z",
    "img":"https:\/\/ichef.bbci.co.uk\/news\/1024\/branded_news\/AFE8\/production\/_114823054_gettyimages-1247238634.jpg","title":"Covid Brazil: Millions to return to poverty if handouts stop - report","content":" The end of Brazil s monthly emergency payments introduced during the Covid-19 pandemic could send 15 million people back into poverty, a study says.\nMore than 67 million people have received the handouts, helping alleviate the impact of the crisis.\nAs a result poverty fell to a historic low of 50 million people, said Fundação Getulio Vargas (FGV), a think tank.\nThe government wants to keep parts of the scheme but there are concerns about its cost.\nPresident Jair Bolsonaro s efforts are stalled in Congress. There are disagreements, even among his supporters, over how to fund the programme without breaking a constitutional spending [...]","source_url":"https:\/\/www.bbc.co.uk\/news\/world-latin-america-54476934","source_name":"bbc.com","category":"World","keywords":"Covid Brazil; Brazil; Covid; Getulio Vargas; President Jair Bolsonaro; Congress; Treasury; Marcelo Neri; Latin America; Latin American; President Bolsonaro"},{
    
    "date":"2020-10-09T15:22:06Z","img":"https:\/\/www.thestar.com\/assets\/img\/thestar-ribbon.png","title":"Nobel win reflects ‘hunger for international co-operation’","content":" JOHANNESBURG - At a time when the COVID-19 pandemic has fractured global alliances and go-it-alone has turned ugly, some world leaders say Friday’s awarding of the Nobel Peace Prize to the U.N. World Food Program was a commitment to the belief that only a concerted effort can save humanity from further disaster.\n“This not only recognizes your tireless work for food security on our planet, but also reminds the key importance of multilateralism that delivers results,” European Council President Charles Michel said in a congratulatory message.\nMore succinctly: “Multilateralism now more important than ever before,“ Swedish Prime Minister Stefan Lofven tweeted.\nAhead of [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/africa\/2020\/10\/09\/nobel-win-reflects-hunger-for-international-co-operation.html","source_name":"Toronto Star","category":"World","keywords":"Nobel; JOHANNESBURG; COVID; Nobel Peace Prize; World Food Program; European Council President Charles Michel; Multilateralism; Swedish Prime Minister Stefan Lofven; Ahead of; United Nations; World Health Organization; President Donald Trump; WFP; American; Trump; Nobel Committee; Berit Reiss; Andersen; British Prime Minister Boris Johnson; Brazilian President Jair Bolsonaro; Brexit; Europe; General Antonio Guterres; Guterres; American David Beasley; Kyrgyzstan; Samoa"},{"date":"2020-10-09T15:15:06Z","img":"https:\/\/images.thestar.com\/1h07vKPUVrXPqj4UcpWCBRNmw3s=\/1280x1024\/smart\/filters:cb(1602256657899)\/https:\/\/www.thestar.com\/content\/dam\/thestar\/news\/world\/us\/2020\/10\/09\/2-former-ebay-employees-plead-guilty-in-harassment-scheme\/BX102-1017_2012_040000.jpg","title":"2 former eBay employees plead guilty in harassment scheme","content":" Stephanie Popp, former senior manager of global intelligence; and Veronica Zea, a former eBay contractor who worked as an intelligence analyst in eBay’s Global Intelligence Center, pleaded guilty to conspiracy to commit cyberstalking and conspiracy to tamper with witnesses. They are scheduled to be sentenced in February.\nThey are among seven former eBay employees charged in the scheme that involved other anonymous deliveries sent to the couple’s home, including a funeral wreath and a bloody pig Halloween mask. Three others are expected to plead guilty later this month\nThe employees also sent pornographic magazines with the husband’s name on them to their [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/us\/2020\/10\/09\/2-former-ebay-employees-plead-guilty-in-harassment-scheme.html","source_name":"Toronto Star","category":"World","keywords":"Stephanie Popp; Veronica Zea; Global Intelligence Center; Halloween; GPS"},{"date":"2020-10-09T16:27:25Z","img":"https:\/\/ichef.bbci.co.uk\/news\/1024\/branded_news\/C190\/production\/_114825594_protest.jpg","title":"Coronavirus: Spain imposes state of emergency on Madrid","content":" The Spanish government has ordered a 15-day state of emergency to bring down Covid-19 infection rates in the capital, after a court overturned a partial lockdown imposed a week ago.\nMadrid and nearby cities will see restrictions enforced by 7,000 police.\nThe capital has been at the centre of a political row, with the centre-right city authorities challenging the Socialist-led government s demands.\nCases are down and a state of emergency is unjustified, say city officials.\nMadrid health minister Enrique Ruiz Escudero insisted that measures already in place were working and that the national government order was \"a measure no Madrileño will understand\".\nLate last [...]","source_url":"https:\/\/www.bbc.co.uk\/news\/world-europe-54478320","source_name":"bbc.com","category":"World","keywords":"Spain; Madrid the Spanish; Covid; Madrid; Enrique Ruiz Escudero; Isabel; When the Madrid; Prime Minister Pedro; Spaniards; Thursday Ms Ayuso; Salvador Illa; Ms Ayuso; Community of Madrid; Spanish; GMT; Fuenlabrada; Getafe; Mayor Jos; Luis Mart; Almeida"},{"date":"2020-10-09T15:45:04Z","img":"https:\/\/www.ctvnews.ca\/polopoly_fs\/1.5139253.1602244012!\/httpImage\/image.jpg_gen\/derivatives\/landscape_620\/image.jpg","title":"Nobel win reflects  hunger for international co-operation ","content":" David Beasley, Executive director of the World Food Program (WFP), centre, celebrates with members of WFP staff in Niamey, Niger, on Oct. 9, 2020, after being awarded the 2020 Nobel Peace prize. (WFP via AP)\nSHARE\nJOHANNESBURG --   At a time when the COVID-19 pandemic has fractured global alliances and go-it-alone has turned ugly, some world leaders say Friday s awarding of the Nobel Peace Prize to the U.N. World Food Program was a commitment to the belief that only a concerted effort can save humanity from further disaster.\n\"This not only recognizes your tireless work for food security on our [...]","source_url":"https:\/\/www.ctvnews.ca\/world\/nobel-win-reflects-hunger-for-international-co-operation-1.5139608","source_name":"CTVnews","category":"World","keywords":"Nobel; David Beasley; World Food Program; WFP; Niamey; Niger; Nobel Peace; AP; SHARE JOHANNESBURG; COVID; Nobel Peace Prize; European Council President Charles Michel; Multilateralism; Swedish Prime Minister Stefan Lofven; Ahead of; United Nations; World Health Organization; President Donald Trump; American; Trump; Nobel Committee; Berit Reiss; Andersen; British Prime Minister Boris Johnson; Brazilian President Jair Bolsonaro; Brexit; Europe; General Antonio Guterres; Guterres; American David Beasley; Kyrgyzstan; Samoa"},{"date":"2020-10-09T15:55:08Z","img":"https:\/\/ichef.bbci.co.uk\/news\/1024\/branded_news\/14750\/production\/_114829738_mediaitem114829737.jpg","title":"Berlin Liebig 34 squat: German police evict dozens","content":" More than 1,500 officers evicted about 50 residents at Liebig 34 - a now-rare symbol of the German capital s radical-left alternative community.\nThe graffiti-covered building, located in a gentrified part of former East Berlin, had housed an \"anarchist-queer-feminist\" community since 1999.\nThe owner decided not to renew the lease two years ago, and sued the occupants when they refused to leave.\nPolice began enforcing the eviction order early on Friday. A few hundred people held a protest as officers removed residents from the four-storey building one by one.\nimage captionThe occupants of Liebig 34 were removed one by one\nA lawyer for the squatters [...]","source_url":"https:\/\/www.bbc.co.uk\/news\/world-europe-54483943","source_name":"bbc.com","category":"World","keywords":"Berlin Liebig; German; Liebig; East Berlin; AFP; Berlin Wall"},{"date":"2020-10-09T15:55:21Z","img":"https:\/\/www.ctvnews.ca\/polopoly_fs\/1.5139619.1602258980!\/httpImage\/image.jpg_gen\/derivatives\/landscape_620\/image.jpg","title":"Afghan negotiator: Nobel nomination nod to women s campaign","content":" KABUL --   Afghan peace negotiator Fawzia Koofi is one of four women representing the Afghan government who have been sitting down at the negotiating table with members of the Taliban for talks that began last month in the Arab state of Qatar.\nShe was also one of 318 candidates -- 211 individuals and 107 organizations -- nominated for the Nobel Peace Prize this year, a nomination that Koofi said gave a boost to Afghan women seeking to claim their rightful role in shaping a peaceful future for Afghanistan.\nThe prestigious award on Friday  for its efforts to combat hunger [...]","source_url":"https:\/\/www.ctvnews.ca\/world\/afghan-negotiator-nobel-nomination-nod-to-women-s-campaign-1.5139617","source_name":"CTVnews","category":"World","keywords":"Afghan; Nobel; KABUL; Fawzia Koofi; Taliban; Arab; Qatar; Nobel Peace Prize; Koofi; Afghanistan; Geneva; University of Diplomacy; In August; Kabul; Elimination of Violence; Protection of Children; AP"},{"date":"2020-10-09T16:10:17Z","img":"https:\/\/www.thestar.com\/assets\/img\/thestar-ribbon.png","title":"Thai army criticized for alleged political use of Twitter","content":" BANGKOK - A former politician whose party was the apparent target of a disguised online propaganda campaign by the Thai army earlier this year said Friday she and her colleagues plan legal action in response.\nPannika Wanich, former spokeswoman for the now-dissolved Future Forward Party, said they had already been gathering information about the army’s information operations — or “IO” — when Twitter announced Thursday that it had identified and removed 926 accounts that had unacknowledged or concealed links to the Thai military.\nShe described the worst aspect of the army’s alleged action to be “using tax money to cause rifts and [...]","source_url":"https:\/\/www.thestar.com\/news\/world\/asia\/2020\/10\/09\/thai-army-criticized-for-alleged-political-use-of-twitter.html","source_name":"Toronto Star","category":"World","keywords":"Thai; Twitter BANGKOK; Pannika Wanich; Future Forward Party; IO; Twitter; Thais; Cuba; Russia; Saudi Arabia; Iran; Thailand; Stanford Internet Observatory; Move Forward Party; California; Parliament; Gen; Santipong Thampiya; Stanford; Army PR"}]