import React from 'react'

function Author() {
    return (
        <div>
            <img src="./author.jpg"/>
            <h1>Уильям Шекспир</h1>
            <p><b>Дата рождения:</b>	не позднее 26 апреля 1564</p>
            <p><b>Место рождения:</b>	Стратфорд-апон-Эйвон, Уорикшир, Англия</p>
            <p><b>Дата смерти:</b>	23 апреля (3 мая) 1616</p>
            <p><b>Место смерти:</b>	Стратфорд-апон-Эйвон, Уорикшир, Англия</p>
            <p><b>Гражданство (подданство):</b> Королевство Англия, Великобритания</p>
            <p><b>Род деятельности:</b> драматург, поэт, актёр</p>
            <p><b>Жанр:</b>	Елизаветинская драма</p>
            <h2>Произведения</h2>
        </div>
    )
}

export default Author
